Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་སྦྱིན་པ་དེ་བཏང་ནས། རྣམ་གྲངས་དུ་མས་འཇིག་རྟེན་གྱི་ཆོས་མ་ནོར་བར་བླངས་པ་དེ་ལ་སྐྱོད་དོ། །དེ་ལས་བསྐྱོད་ནས་ཐབས་མཁས་པས། འཕགས་པའི་ཆོས་རྣམས་དང་། འཕགས་པའི་ཆོས་ཀྱི་འབྲས་བུ་དག་ལ་རབ་ཏུ་འགོད་དོ།
en: Subhūti, having dispensed that mundane gift of the Dharma, bodhisattva great beings through many ways then dissuade beings from accepting mundane dharmas without error, and after dissuading them, they also establish them through skill in means in the noble ones’ dharmas and in the fruits of the noble ones’ dharmas.

source: །དེ་ལ་འཕགས་པའི་ཆོས་རྣམས་ནི་གང་འཕགས་པའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུ་ནི་གང་ཞེ་ན། འཕགས་པའི་ཆོས་ཞེས་བྱ་བ་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་མོ། །འཕགས་པའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུ་ནི།
en: If you ask what are the noble ones’ dharmas and the fruits of the noble ones’ dharmas, the noble ones’ dharmas comprise the thirty-seven factors conducive to enlightenment and the three gateways of liberation.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དེ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཕགས་པའི་ཆོས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པའོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཤེས་པའོ། །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཤེས་པའོ། །དགྲ་བཅོམ་པ་ཉིད་ཤེས་པའོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤེས་པའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤེས་པའོ། །ནང་སྟོང་པ་ཉིད་ཤེས་པའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཤེས་པའོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ཤེས་པའོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཤེས་པའོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཤེས་པའོ།
en: The fruits of the noble ones’ dharmas comprise the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship. “

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཤེས་པའོ། །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ཤེས་པའོ།
en: Subhūti, the noble ones’ dharmas of bodhisattva great beings also include knowledge of the fruit of entering the stream to nirvāṇa, knowledge of the fruit of being destined for only one more rebirth, knowledge of the fruit of no longer being subject to rebirth, knowledge of arhatship, knowledge of the perfection of generosity, knowledge of the perfection of ethical discipline, knowledge of the perfection of tolerance, knowledge of the perfection of perseverance, knowledge of the perfection of meditative concentration, knowledge of the perfection of wisdom, knowledge of the emptiness of internal phenomena, and knowledge of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; knowledge of the thirty-seven factors conducive to enlightenment; knowledge of the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers; as well as knowledge of the meditative stabilities and the dhāraṇī gateways; knowledge of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and knowledge of great loving kindness, great compassion, great empathetic joy, and great equanimity.

source: །གཞན་ཡང་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་ཆོས་རྣམས་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཤེས་པ་སྟེ།
en: In addition, they include knowledge of mundane and supramundane phenomena, of contaminated and uncontaminated phenomena, and of conditioned and unconditioned phenomena. {

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་མ་གཏོགས་པར་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཕགས་པའི་ཆོས་རྣམས་སོ།
en: Ki.VIII: 55} With the exception of the wisdom of all-aspect omniscience, these are all the noble ones’ dharmas of bodhisattva great beings. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཕགས་པའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུ་གང་ཞེ་ན། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་སྟེ།
en: Then, if you ask what constitutes the fruit of the noble ones’ dharmas of bodhisattva great beings, this denotes the abandonment of all the afflicted mental states and their connecting propensities.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཕགས་པའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This is the fruit of the noble ones’ dharmas of bodhisattva great beings.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, will bodhisattva great beings also attain all-aspect omniscience?” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Bodhisattva great beings will also attain all-aspect omniscience.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བྱེ་བྲག་ཏུ་ཅི་ཞིག་མཆིས།
en: Blessed Lord, if bodhisattva great beings will also attain all-aspect omniscience, what then is the distinction between bodhisattva great beings and the tathāgatas, arhats, completely awakened buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་བྱེ་བྲག་ཡོད་དོ། །གསོལ་པ།
en: There is a distinction,” replied the Blessed One. “

source: བྱེ་བྲག་ཅི་ལྟ་བུ་ཞིག་མཆིས།
en: What is the distinction?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་བརྙེས་པ་ཞེས་བྱའོ།
en: Bodhisattva great beings will attain all-aspect omniscience, but the tathāgatas are those said to have already acquired that wisdom,” replied the Blessed One. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ལ་གནས་ཤིང་ཆོས་ཐམས་ཅད་ལ་མུན་པ་མེད་པ་ཐོབ་པ་ལ། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱང་གཞན་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐུགས་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དོ།
en: If you ask why, for those who dwell in it and have attained nonobfuscation with respect to all phenomena, it is not said that the mind of the bodhisattva is one thing and the mind of the tathāgata, arhat, completely awakened buddhas another. “

source: །རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་སྦྱིན་པ་སྟེ།
en: Such then, Subhūti, is the bodhisattva great beings’ mundane gift of Dharma.

source: དེ་ལ་བརྟེན་པས་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་འབྱུང་ངོ་།
en: Based on that, the supramundane gift of Dharma will emerge.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་སྦྱིན་པ་ལ་སྦྱོར་ཞིང་། ཐབས་མཁས་པས་འཕགས་པའི་ཆོས་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པ་ལ་བཀོད་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་འགོད་པ་ཡིན་ནོ།
en: It is in this manner, Subhūti, that bodhisattva great beings engage beings in the mundane giving of Dharma, and through skill in means will establish them in the noble ones’ supramundane giving of Dharma, and then establish them in [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། སྨོན་གནས་ཤེས་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཤིན་དུ་ཡོངས་སུ་དག་པ་བཞི་དང་། དབང་བཅུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བསྲུང་བ་མེད་པ་གསུམ་དང་། དགོངས་པ་ཉེ་བར་གཞག་པ་གསུམ་དང་། བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཉིད་དང་། བག་ཆགས་ཀྱི་སྒྲིབ་པ་སྤངས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: Subhūti, if you ask what constitutes the bodhisattva great beings’ supramundane giving of Dharma that is not shared in common with all ordinary people, it is as follows: the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven aspects of enlightenment, the noble eightfold path, the three gateways to liberation, the eight aspects of liberation, the nine serial steps of meditative absorption, the ten sense fields of complete suffusion, the eight sense fields of mastery, seclusion devoid of afflicted mental states, knowledge based on aspiration, the six extrasensory powers, {Ki.

source: སྙིང་རྗེ་ཆེན་པོ་དང་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། གཟུངས་ཀྱི་སྒོ་ལྔ་བརྒྱ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམས་ཏེ།
en: VIII: 56} the four utter purities, the ten controls, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the three unguarded states, the three consolidations of enlightened intention, the undiminished reality, the renunciation of the obscuration of propensities, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, the thirty-two major marks and eighty minor marks of a great person, the five hundred dhāraṇī gateways, and the gateways of meditative stability.

source: འདི་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་ཞེས་བྱའོ།
en: These are said to constitute the supramundane giving of Dharma. “

source: །རབ་འབྱོར་དེ་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: In this regard, Subhūti, if you ask what constitute the four applications of mindfulness, [they comprise mindfulness of body, feelings, thoughts, and phenomena.

source: ནང་གི་ལུས་དང་། ཕྱིའི་ལུས་དང་། ཕྱི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བརྩོན་འགྲུས་ཅན།
en: Bodhisattva great beings] should continue to observe the body—the inner body, the outer body, and the outer and inner body combined.

source: ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་། རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions.

source: །ལུས་ལ་ཀུན་འབྱུང་བའི་རྗེས་སུ་ལྟ་ཞིང་། རྣམ་པར་སྤྱོད་དོ། །ལུས་ལ་ཟད་པའི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་དོ། །ལུས་ལ་ཀུན་འབྱུང་བ་དང་། ཟད་པའི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་དོ།
en: They continue to observe the origin [of suffering] with respect to the body, they continue to observe the cessation [of suffering] with respect to the body, and they continue to observe the origin and cessation [of suffering] with respect to the body.

source: །ལུས་ལ་མི་གནས་པར་རྣམ་པར་སྤྱོད་ཅིང་འཇིག་རྟེན་དུ་གང་ཡང་ཉེ་བར་ལེན་པ་མེད་དོ། །ནང་གི་ཚོར་བ་དང་། ཕྱིའི་ཚོར་བ་དང་། ཕྱི་ནང་གི་ཚོར་བ་དང་། ནང་གི་སེམས་དང་།
en: They continue [to do so] without dwelling on the body, and they are not acquisitive of anything at all in the world. “

source: ཕྱིའི་སེམས་དང་། ཕྱི་ནང་གི་སེམས་དང་། ནང་གི་ཆོས་དང་། ཕྱིའི་ཆོས་དང་། ཕྱི་ནང་གི་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: They continue to observe inner feelings, outer feelings, outer and inner feelings combined, inner thoughts, outer thoughts, outer and inner thoughts combined, and inner phenomena, outer phenomena, and outer and inner phenomena combined.

source: བརྩོན་འགྲུས་ཅན། ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཞིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions.

source: །ཆོས་ལ་ཀུན་འབྱུང་བའི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་དོ། །ཆོས་ལ་ཟད་པའི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་དོ།
en: They continue to observe the origin [of suffering] with respect to phenomena [and so forth], they continue to observe the cessation [of suffering] with respect to phenomena [and so forth], and they continue to observe the origin and cessation [of suffering] with respect to phenomena [and so forth].

source: །ཆོས་ལ་མི་གནས་པར་རྣམ་པར་སྤྱོད་ཅིང་འཇིག་རྟེན་དུ་གང་ཡང་ཉེ་བར་ལེན་པ་མེད་དོ།
en: They continue [to do so] without dwelling on phenomena [and so forth], and they are not acquisitive of anything at all in the world. “

source: །རབ་འབྱོར་ཡང་དག་པར་སྤོང་བ་བཞི་གང་ཞེ་ན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་མོས་པ་སྐྱེད་པ་དང་།
en: Subhūti, if you ask what constitute the four correct exertions, [bodhisattva great beings] resolve that negative and nonvirtuous attributes that have not yet arisen might not be developed.

source: བསྐྱེད་པ་རྣམས་སྤོང་བའི་ཕྱིར་རྩོལ་བ་དང་།
en: They struggle so that negative and nonvirtuous attributes that have previously arisen might be renounced.

source: དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་མོས་པ་སྐྱེད་ཅིང་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: They resolve and strive that virtuous attributes that have not yet arisen might be developed.

source: སྐྱེས་པ་རྣམས་འཕེལ་ཞིང་ཤིན་དུ་རྒྱས་པར་བྱ་བ་དང་། བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་མོས་པ་བསྐྱེད་པའོ།
en: They resolve that virtuous attributes that have previously arisen should flourish and absolutely increase, their cultivation reaching complete perfection. “

source: །རབ་འབྱོར་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་གང་ཞེ་ན། མོས་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། སེམས་དང་བརྩོན་འགྲུས་དང་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའོ།
en: Subhūti, if you ask what constitute the four supports for miraculous abilities, they comprise the support for miraculous ability that combines the meditative stability of resolution with the formative force of exertion, and the supports for miraculous ability that combine the meditative stabilities of perseverance, thought, and scrutiny with the formative force of exertion. “

source: །རབ་འབྱོར་དབང་པོ་ལྔ་གང་ཞེ་ན། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: Subhūti, if you ask what constitute the five faculties, they comprise the faculty of faith, the faculty of perseverance, the faculty of recollection, the faculty of meditative stability, and the faculty of wisdom.

source: ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། དེ་དག་ནི་དབང་པོ་ལྔ་ཞེས་བྱའོ།
en: These are called the five faculties. “

source: །རབ་འབྱོར་སྟོབས་ལྔ་གང་ཞེ་ན། དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཏེ།
en: Subhūti, if you ask what constitute the five powers, they comprise the power of faith, the power of perseverance, the power of recollection, the power of meditative stability, and the power of wisdom.

source: དེ་དག་ནི་སྟོབས་ལྔ་ཞེས་བྱའོ།
en: These are called the five powers. {Ki.

source: །རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གང་ཞེ་ན། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: VIII: 57} “Subhūti, if you ask what constitute the seven branches of enlightenment, they comprise the branch of enlightenment that entails correct recollection, the branch of enlightenment that entails correct doctrinal analysis, the branch of enlightenment that entails correct perseverance, the branch of enlightenment that entails correct delight, the branch of enlightenment that entails correct mental and physical refinement, the branch of enlightenment that entails correct meditative stability, and the branch of enlightenment that entails correct equanimity.

source: ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཞེས་བྱའོ།
en: These are called the seven branches of enlightenment. “

source: །རབ་འབྱོར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་།
en: Subhūti, if you ask what constitutes the noble eightfold path, it comprises correct view, correct ideation, correct speech, correct action, correct livelihood, correct effort, correct recollection, and correct meditative stability.

source: ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ། འདི་དག་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཞེས་བྱའོ།
en: These are called the noble eightfold path. “

source: །དེ་ལ་ཏིང་ངེ་འཛིན་གསུམ་གང་ཞེ་ན། སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: If you ask what constitute the three meditative stabilities, they comprise the meditative stability of emptiness, the meditative stability of signlessness, and the meditative stability of wishlessness.

source: །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། སྟོང་པའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པར་སེམས་རྩེ་གཅིག་པ་སྟེ། དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: If you ask what constitutes the meditative stability of emptiness, one-pointedness of mind with respect to the aspects of emptiness and the aspects of voidness—that is called the meditative stability of emptiness.

source: །མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཞི་བའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པར་སེམས་རྩེ་གཅིག་པ་སྟེ། དེ་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: If you ask what constitutes the meditative stability of signlessness, one-pointedness of mind with respect to the aspects of peace and the aspects of signlessness—that is called the meditative stability of signlessness.

source: །སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་གྱི་རྣམ་པར་སེམས་རྩེ་གཅིག་པ་སྟེ། དེ་ནི་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: If you ask what constitutes the meditative stability of wishlessness, one-pointedness of mind with respect to the aspects of impermanence and the aspects of suffering—that is called the meditative stability of wishlessness. “

source: །རྣམ་པར་ཐར་པ་བརྒྱད་གང་ཞེ་ན། གཟུགས་ཅན་གྱིས་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ།
en: If you ask what constitute the eight aspects of liberation, they are as follows: The first aspect of liberation is that which ensues when corporeal beings observe physical forms.

source: །བཟང་བར་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ།
en: The third aspect of liberation ensues when beings are inclined toward pleasant states.

source: །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ།
en: The fourth aspect of liberation ensues when one achieves and dwells in the sphere of infinite space.

source: །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ།
en: The fifth aspect of liberation ensues when one achieves and dwells in the sphere of infinite consciousness.

source: །ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ།
en: The sixth aspect of liberation ensues when one achieves and dwells in the sphere of nothing-at-all.

source: །འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བདུན་པའོ།
en: The seventh aspect of liberation ensues when one achieves and dwells in the sphere of neither perception nor nonperception.

source: །འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ། གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་པ་སྟེ།
en: The eighth aspect of liberation ensues when one achieves and dwells in the cessation of perceptions and feelings.

source: དེ་དག་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་ཅེས་བྱའོ།
en: These are called the eight aspects of liberation. {Ki.

source: །མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་གང་ཞེ་ན། འདི་ལ་ལ་ལ་འདོད་པས་དབེན་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་།
en: VIII: 58} “If you ask what constitute the nine serial steps of meditative absorption, in this regard, [the first ensues] when someone achieves and then maintains the first meditative concentration, that is to say, when there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom. [

source: བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་དེ་ཉེ་བར་ཞི་ནས། ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ།
en: The second ensues] when someone achieves and then maintains the second meditative concentration, that is to say, when there is an intense inner clarity consequent on the calming of ideation and scrutiny—the absence of ideation and the absence of scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present. [

source: དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན། བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་བཏང་སྙོམས་སུ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: The third ensues] when someone achieves and then maintains the third meditative concentration free from joy, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་རྣམ་པར་སྤྱོད་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: This is what sublime beings describe as ‘mindful, abiding in bliss, and equanimous.’ [

source: །དེ་བདེ་བ་ཡང་སྤངས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་།
en: The fourth ensues] when someone achieves and then maintains the fourth meditative concentration, that is to say, when even that sense of bliss is abandoned and suffering has also been eliminated.

source: ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད་སྡུག་བསྔལ་བ་ཡང་མེད་པའི་བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Here, neither suffering nor bliss is present because even former blissful and unhappy states of mind have subsided, while equanimity and mindfulness are utterly pure. [

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་ཏེ་འདི་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཞེས་བྱའོ།
en: The ninth ensues] when someone achieves and then maintains the cessation of perceptions and feelings, that is to say, when the sphere of neither perception nor nonperception has been completely transcended in all respects. These are called the nine serial steps of meditative absorption. “

source: །དེ་ལ་མཐའ་དག་གི་སྐྱེ་མཆེད་བཅུ་གང་ཞེ་ན། མཐའ་དག་ས་དང་མཐའ་དག་ཆུ་དང་མཐའ་དག་མེ་དང་མཐའ་དག་རླུང་དང་། མཐའ་དག་སྔོན་པོ་དང་མཐའ་དག་སེར་པོ་དང་མཐའ་དག་དམར་པོ་དང་། མཐའ་དག་དཀར་པོ་དང་། མཐའ་དག་རྣམ་པར་ཤེས་པ་དང་།
en: If you ask what constitute the ten sense fields of complete suffusion, they comprise the complete suffusion of the earth element, the complete suffusion of the water element, the complete suffusion of the fire element, the complete suffusion of the wind element, the complete suffusion of blueness, the complete suffusion of yellowness, the complete suffusion of redness, the complete suffusion of whiteness, the complete suffusion of consciousness, and the complete suffusion of the space element.

source: མཐའ་དག་ནམ་མཁའ་སྟེ། དེ་དག་ནི་མཐའ་དག་གི་སྐྱེ་མཆེད་བཅུ་ཞེས་བྱའོ།
en: These are called the ten sense fields of complete suffusion. “
